0Bu/daikin-altherma-esp32/sdkconfig.defaults
# The target belongs to the project, not to whichever idf.py command happened to run first.
# CONFIG_APP_REPRODUCIBLE_BUILD removes wall-clock build metadata so two clean builds of the same
# commit, version and lockfile produce the same application bytes.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Target is esp32s3.
# No BLE is used. The official hardware contract is a WiFi-capable ESP32-S3 with >=8 MB flash.

# Flash. 8 MB is the official baseline and sizes partitions.csv. The upper half starts with the
# full-resolution 24-hour history partition; a physical 4 MB device is therefore unsupported.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console over native USB-Serial/JTAG — present on esp32s3 (the XIAO
# ESP32-S3 exposes it on its USB-C port). This console is a SEPARATE UART from the
# heat-pump X10A link (rx_pin/tx_pin), so device logs never collide with the
# heat-pump serial traffic.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# OTA: roll back automatically if a freshly-flashed image fails to boot/run. The new app
# must call esp_ota_mark_app_valid_cancel_rollback() once healthy (see main.cpp / the
# ota_health_gate), otherwise the bootloader reverts to the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ── Signed OTA images (Secure Boot v2 signature scheme, WITHOUT hardware Secure Boot) ──
# Require a valid RSA-3072 app signature on every OTA update, so a compromised update host
# can no longer push UNSIGNED firmware. No eFuses are burned: reversible, no brick risk, and
# the web installer / USB-flash path keeps working (the running app verifies the NEXT OTA
# image; the bootloader does not verify on boot). Trust is trust-on-first-use from the running
# app's own signature block. Full key lifecycle: docs/SECURITY.md.
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
# Do NOT sign during the build: CI signs the finished image in a separate step
# (scripts/ci-build-all.sh) with the offline key, so the private key never has to be present
# at compile time and fork/PR builds (no secret) still compile.
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=n

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# Dynamic TX buffers. The policy is a Kconfig CHOICE (ESP_WIFI_TX_BUFFER), whose options are the
# booleans ESP_WIFI_STATIC_TX_BUFFER / ESP_WIFI_DYNAMIC_TX_BUFFER — so the dynamic option is what a
# defaults file can actually select. CONFIG_ESP_WIFI_TX_BUFFER_TYPE is a promptless int the choice
# DERIVES, and a promptless symbol cannot be set from here: the `=1` this line used to carry pinned
# nothing, and dynamic buffers held only because they are upstream's default anyway. That is the
# inert-setting-that-reads-like-a-guarantee shape the HTTPD_QUEUE_WORK_BLOCKING and
# COREDUMP_DATA_FORMAT_ELF notes below already warn about, so it is spelled as the real symbol.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# LWIP sockets — the default of 10 is tight: the http server (several open sockets), its
# listener, mDNS, SNTP, the MQTT bridge and the OTA client can leave no BSD socket free.
# Lift the cap to match the TCP PCB pools (16) so the background OTA download has room.
CONFIG_LWIP_MAX_SOCKETS=16

# Give DHCP fingerprinting the same stable product identity as option 12 and mDNS. ESP-IDF 6.0.2
# uses the netif hostname as option 60 when vendor-class support is enabled, so this needs no
# lease stop/start or second product string. Pin the matching upstream buffer default explicitly:
# check-sdkconfig-defaults.py can then prove that a generated config has room for the added option.
CONFIG_LWIP_DHCP_DISABLE_VENDOR_CLASS_ID=n
CONFIG_LWIP_DHCP_OPTIONS_LEN=109

# LWIP TCP windows — double the default send/receive windows (8xMSS).  The dashboard has a strict
# 160 KiB gzip build limit and is normally smaller; reducing the artefact is safer than growing
# per-socket buffers on a device whose contiguous heap is already the binding resource.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=11520

# Stack sizes — a comfortable main task stack for NVS + HTTP + the poll engine.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Catch a stack overflow AT THE FIRST WRITE past the limit, with a hardware watchpoint, instead of
# at the next context switch. IDF's default is the CANARY check, and v1.0.12 is exactly the failure
# the canary misses: the httpd task ran 460 bytes off its floor, wrote past it into its own TCB
# (clobbering pvThreadLocalStoragePointers[0] with 0x4) and kept running. A canary is only compared
# when the scheduler switches, and a frame that writes SPARSELY below the limit can miss the canary
# words entirely — this one left the neighbouring TLS[1] intact, which is how we know it did. The
# task then died ~44 s later inside lwip's pthread_getspecific, with a backtrace pointing at the
# WebSocket send rather than at anything responsible, and diagnosing it took a core dump and gdb.
# A watchpoint panics at the offending instruction instead. Cost: one of the two ESP32-S3 debug
# watchpoints, which this project does not otherwise use (it debugs from core dumps, not JTAG).
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# WebSockets support: OFF, and stated explicitly rather than left to the Kconfig default, because
# this firmware DELIBERATELY has no live-push surface. The web UI polls /status and /values; the
# /events WebSocket was removed after a lost queue message wedged a stream silently (#238) and its
# broadcaster put the /status builder on the task that owns the X10A UART (#241). See
# docs/ARCHITECTURE.md "Push vs. poll". Nothing calls httpd_queue_work() any more either, so
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING (added as the #238 backstop) is gone with it — an inert setting
# reads as a live safeguard.
CONFIG_HTTPD_WS_SUPPORT=n

# ── Firmware size reduction ──
# Optimize the release image for size. The complete host suite plus the signed hardware acceptance
# exercise the same code paths; keeping the default debug optimization would cross the fixed OTA
# slot after the device-local locale catalogs are embedded.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# Drop code paths this firmware never uses.
# mbedTLS human-readable error-string tables — we only log numeric TLS codes (MQTTS/OTA). ~6 KB.
CONFIG_MBEDTLS_ERROR_STRINGS=n
# No TLS session-ticket resumption: our TLS clients (OTA fetch, MQTTS bridge) open few,
# long-lived connections where resumption buys nothing. ~1.8 KB.
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=n
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=n
# No filesystem: certs/keys come from the CA bundle and NVS, never a VFS path. ~1.2 KB.
CONFIG_MBEDTLS_FS_IO=n
# Keep CA verification for MQTTS, OTA and forecasts, but use ESP-IDF's common-root subset. It
# retains roughly 99% public-root coverage at about half the flash cost of the full Mozilla set;
# brokers chained only to a rare excluded root need a certificate chain rooted in this subset.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# Allocate TLS RX/TX records only when needed, size them for the actual record, and return large
# buffers to small cache buffers after use. ESP-IDF 6.0.2's dynamic-buffer port applies this to OTA,
# weather and optional MQTTS and removes the connection-long 16 KiB RX + 4 KiB TX reservation.
# Keep config/key/CA lifetime unchanged: freeing those after a handshake would require every
# reconnect path to register them again and is a separate, riskier optimisation.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=n
# Silent asserts — keep the abort()/reboot on a failed assertion (so a bad state still
# reverts via the rollback gate) but drop the assert string tables. ~5 KB.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# No WPA3-OWE STA support — we join a WPA2-PSK home network. ~0.8 KB.
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n

# C++ exceptions — HTTP handlers run under a try/catch OOM guard (503 instead of crash), the
# same memory discipline.
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# PSRAM (uncomment if your board has it; not required)
# CONFIG_SPIRAM=y

# Core Dump to Flash (Method 2)
# ENABLE_TO_FLASH is the line that does the work — it select-s ESP_COREDUMP_ENABLE. Don't add
# CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF: ELF is the only format in IDF v6 and the symbol is no longer
# declared, so the assignment never reaches the generated sdkconfig — it reads like a guarantee
# while doing nothing.
CONFIG_ESP_COREDUMP_ENABLE=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# ── Task Watchdog Timer (TWDT) ──
# Turn a genuinely-wedged worker task into a clean, automatic REBOOT instead of a silent hang. The
# poll engine (hp_poll) and the MQTT publish task (mqtt_pub) do the real, potentially-blocking I/O
# (X10A UART reads / MQTT publishes); each subscribes itself (esp_task_wdt_add) and feeds the
# watchdog every cycle — hp_poll also once per register during the X10A sweep, so a slow-but-
# progressing 9600-baud sweep never looks like a hang. A read or publish that is genuinely stuck
# trips the 20 s timeout. The idle-task watch (INIT=y) still catches CPU starvation; this adds the
# blocked-but-scheduled case it can't see.
#   TIMEOUT_S=20 — comfortably above the 1 s poll cadence and any real register sweep (worst case a
#     silent bus is ~13 regs × 300 ms ≈ 4 s), so only a real hang fires.
#   PANIC=y — a timeout REBOOTS (panic handler) rather than only printing a warning; esp_reset_reason()
#     then reports ESP_RST_TASK_WDT, which the crash pipeline classifies as a fault and surfaces on
#     /status.last_crash + the retained MQTT crash topic (logic/crashinfo.hpp — "task_wdt").
#   INIT=y — initialise the TWDT at startup and keep the default idle-task subscription.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_TASK_WDT_PANIC=y
